# ScheduleTypeForBrowser Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ScheduleTypeForBrowser Property
ParameterTypeId Class See Also
---
"Schedule Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ScheduleTypeForBrowser { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ScheduleTypeForBrowser As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ScheduleTypeForBrowser {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace